; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-8-4-20)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	driver7 - driver
	driver8 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	s0 - location
	s1 - location
	s2 - location
	p0-2 - location
	p2-1 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s1)
	(at driver3 s1)
	(at driver4 s1)
	(at driver5 s0)
	(at driver6 s2)
	(at driver7 s0)
	(at driver8 s0)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s0)
	(empty truck2)
	(at truck3 s0)
	(empty truck3)
	(at truck4 s2)
	(empty truck4)
	(at package1 s0)
	(at package2 s0)
	(at package3 s2)
	(at package4 s1)
	(at package5 s2)
	(at package6 s2)
	(at package7 s0)
	(at package8 s1)
	(at package9 s2)
	(at package10 s2)
	(at package11 s2)
	(at package12 s1)
	(at package13 s0)
	(at package14 s1)
	(at package15 s1)
	(at package16 s1)
	(at package17 s1)
	(at package18 s0)
	(at package19 s0)
	(at package20 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(link s0 s1)
	(link s1 s0)
	(link s1 s2)
	(link s2 s1)
	(link s2 s0)
	(link s0 s2)
)
	(:goal (and
	(at driver1 s1)
	(at driver3 s1)
	(at driver4 s2)
	(at driver5 s2)
	(at driver6 s1)
	(at driver7 s0)
	(at truck2 s2)
	(at truck3 s2)
	(at package1 s1)
	(at package2 s0)
	(at package3 s1)
	(at package4 s0)
	(at package5 s1)
	(at package6 s2)
	(at package7 s1)
	(at package8 s2)
	(at package9 s2)
	(at package10 s2)
	(at package11 s0)
	(at package12 s1)
	(at package13 s0)
	(at package14 s2)
	(at package15 s1)
	(at package16 s1)
	(at package17 s1)
	(at package18 s2)
	(at package19 s2)
	(at package20 s1)
	))


)

; plan
1. (board-truck driver8 s0 truck2)
   deleted: (at driver8 s0) (empty truck2)
   added: (driving driver8 truck2)
   goals met: 12 of 28
2. (load-truck s2 package5 truck4)
   deleted: (at package5 s2)
   added: (in package5 truck4)
   goals met: 12 of 28
3. (board-truck driver6 s2 truck4)
   deleted: (at driver6 s2) (empty truck4)
   added: (driving driver6 truck4)
   goals met: 12 of 28
4. (drive-truck driver6 s2 s1 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s1)
   goals met: 12 of 28
5. (load-truck s1 package8 truck4)
   deleted: (at package8 s1)
   added: (in package8 truck4)
   goals met: 12 of 28
6. (unload-truck s1 package5 truck4)
   deleted: (in package5 truck4)
   added: (at package5 s1)
   goals met: 13 of 28
7. (load-truck s1 package4 truck4)
   deleted: (at package4 s1)
   added: (in package4 truck4)
   goals met: 13 of 28
8. (drive-truck driver6 s1 s2 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s2)
   goals met: 13 of 28
9. (unload-truck s2 package8 truck4)
   deleted: (in package8 truck4)
   added: (at package8 s2)
   goals met: 14 of 28
10. (load-truck s2 package3 truck4)
   deleted: (at package3 s2)
   added: (in package3 truck4)
   goals met: 14 of 28
11. (drive-truck driver6 s2 s1 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s1)
   goals met: 14 of 28
12. (unload-truck s1 package3 truck4)
   deleted: (in package3 truck4)
   added: (at package3 s1)
   goals met: 15 of 28
13. (load-truck s1 package14 truck4)
   deleted: (at package14 s1)
   added: (in package14 truck4)
   goals met: 15 of 28
14. (drive-truck driver6 s1 s2 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s2)
   goals met: 15 of 28
15. (unload-truck s2 package14 truck4)
   deleted: (in package14 truck4)
   added: (at package14 s2)
   goals met: 16 of 28
16. (load-truck s2 package11 truck4)
   deleted: (at package11 s2)
   added: (in package11 truck4)
   goals met: 16 of 28
17. (drive-truck driver6 s2 s0 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s0)
   goals met: 16 of 28
18. (unload-truck s0 package4 truck4)
   deleted: (in package4 truck4)
   added: (at package4 s0)
   goals met: 17 of 28
19. (unload-truck s0 package11 truck4)
   deleted: (in package11 truck4)
   added: (at package11 s0)
   goals met: 18 of 28
20. (drive-truck driver6 s0 s1 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   goals met: 18 of 28
21. (disembark-truck driver6 s1 truck4)
   deleted: (driving driver6 truck4)
   added: (at driver6 s1) (empty truck4)
   goals met: 19 of 28
22. (load-truck s0 package7 truck2)
   deleted: (at package7 s0)
   added: (in package7 truck2)
   goals met: 19 of 28
23. (load-truck s0 package19 truck2)
   deleted: (at package19 s0)
   added: (in package19 truck2)
   goals met: 19 of 28
24. (load-truck s0 package18 truck2)
   deleted: (at package18 s0)
   added: (in package18 truck2)
   goals met: 19 of 28
25. (drive-truck driver8 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 20 of 28
26. (board-truck driver7 s0 truck3)
   deleted: (at driver7 s0) (empty truck3)
   added: (driving driver7 truck3)
   goals met: 19 of 28
27. (unload-truck s2 package19 truck2)
   deleted: (in package19 truck2)
   added: (at package19 s2)
   goals met: 20 of 28
28. (unload-truck s2 package18 truck2)
   deleted: (in package18 truck2)
   added: (at package18 s2)
   goals met: 21 of 28
29. (load-truck s0 package1 truck3)
   deleted: (at package1 s0)
   added: (in package1 truck3)
   goals met: 21 of 28
30. (walk driver1 s2 p2-1)
   deleted: (at driver1 s2)
   added: (at driver1 p2-1)
   goals met: 21 of 28
31. (walk driver1 p2-1 s1)
   deleted: (at driver1 p2-1)
   added: (at driver1 s1)
   goals met: 22 of 28
32. (walk driver4 s1 p2-1)
   deleted: (at driver4 s1)
   added: (at driver4 p2-1)
   goals met: 22 of 28
33. (walk driver4 p2-1 s2)
   deleted: (at driver4 p2-1)
   added: (at driver4 s2)
   goals met: 23 of 28
34. (walk driver5 s0 p0-2)
   deleted: (at driver5 s0)
   added: (at driver5 p0-2)
   goals met: 23 of 28
35. (walk driver5 p0-2 s2)
   deleted: (at driver5 p0-2)
   added: (at driver5 s2)
   goals met: 24 of 28
36. (drive-truck driver8 s2 s1 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   goals met: 23 of 28
37. (unload-truck s1 package7 truck2)
   deleted: (in package7 truck2)
   added: (at package7 s1)
   goals met: 24 of 28
38. (drive-truck driver8 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 25 of 28
39. (drive-truck driver7 s0 s1 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   goals met: 25 of 28
40. (unload-truck s1 package1 truck3)
   deleted: (in package1 truck3)
   added: (at package1 s1)
   goals met: 26 of 28
41. (drive-truck driver7 s1 s0 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   goals met: 26 of 28
42. (drive-truck driver7 s0 s2 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   goals met: 27 of 28
43. (disembark-truck driver7 s2 truck3)
   deleted: (driving driver7 truck3)
   added: (at driver7 s2) (empty truck3)
   goals met: 27 of 28
44. (walk driver7 s2 p0-2)
   deleted: (at driver7 s2)
   added: (at driver7 p0-2)
   goals met: 27 of 28
45. (walk driver7 p0-2 s0)
   deleted: (at driver7 p0-2)
   added: (at driver7 s0)
   goals met: 28 of 28
